[gold]
read_verilog -sv adder3.sv
prep -top nerv
memory_map